app/controllers/api/v1/posicao_agressor_controller.rb

UPDATE "agressors" SET "latitude" = $1, "longitude" = $2, "updated_at" = $3 WHERE "agressors"."id" = $4  [["latitude", 74.4568], ["longitude", 77.9865], ["updated_at", "2018-09-26 23:21:47.348475"], ["id", 1]]
---
	def nova_posicao
		@agressor.latitude = agressor_params[:latitude]
		@agressor.longitude = agressor_params[:longitude]
		@agressor.save

SELECT  "agressors".* FROM "agressors" WHERE "agressors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
   def set_agressor

     @agressor = Agressor.find(params[:id])