app/controllers/api/v1/trackings_controller.rb

INSERT INTO "tracks" ("latitude", "longitude", "trackable_type", "trackable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
      def create
        # cria uma nova posição no banco de dados
        # contendo os dados de lat/long e também do recurso (vitima/agressor)
        @track = Track.new(track_params).save!